onegbps/files/huawei/FTTH_IPTV_ADD_31.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:os="os.xsd.v1">
   <soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <wsse:UsernameToken wsu:Id="UsernameToken-2" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:Username>clarity</wsse:Username>
      <wsse:Password >Test1234#</wsse:Password>
    </wsse:UsernameToken>
  </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <os:MODIFY-ONT>
         <os:MODIFIER>ONT</os:MODIFIER>
         <os:object>
            <os:DEV>ADSL_ZTE_DNAME</os:DEV>
            <os:FN>FTTH_HUW_FN</os:FN>
            <os:SN>FTTH_HUW_SN</os:SN>
            <os:PN>FTTH_HUW_PN</os:PN>
            <os:ONTID>FTTH_HUW_VP</os:ONTID>
         </os:object>
         <os:Session>1</os:Session>
         <os:objectParas>
            <os:LINEPROF>TRIPLEPLAY_MULTI_IPTV</os:LINEPROF>
            <os:SRVPROF>HG8245_TRIPLE_MULTI_IPTV(2)</os:SRVPROF>
            <os:VAPROFILE>Huawei_IMS_MULTI_IPTV(2)</os:VAPROFILE>
         </os:objectParas>
      </os:MODIFY-ONT>
   </soapenv:Body>
</soapenv:Envelope>
